-- TODO: シードを整理する
use finansu_db;

INSERT INTO
    years (year)
VALUES
    (2025);

-- ユーザーを一括で挿入
INSERT INTO
    users (name, bureau_id, role_id)
VALUES
    -- 一般ユーザー
    ('技大太郎1', 1, 1),
    -- 管理者ユーザー
    ('技大太郎2', 6, 2),
    -- 財務局長
    ('技大太郎3', 3, 3),
    -- 財務局員
    ('技大太郎4', 3, 4);

INSERT INTO
    financial_records (name, year_id)
VALUES
    ('総務局', 1),
    ('渉外局', 1);

INSERT INTO
    divisions (name, financial_record_id)
VALUES
    ('衛生管理部門', 1),
    ('国際部門', 1),
    ('広報部門', 2),
    ('ゲスト部門', 2);

INSERT INTO
    festival_items (name, memo, division_id)
VALUES
    ('農ポリ', '', 1),
    ('養生テープ', '', 1),
    ('ラミ', '', 2),
    ('広報物郵送費', '', 3),
    ('折込チラシ用費', '', 3),
    ('ゲストブッキング費', '', 4),
    ('ゲスト用菓子折り費', '', 4);

INSERT INTO
    item_budgets (amount, festival_item_id)
VALUES
    (10000, 1),
    (10000, 2),
    (10000, 3),
    (20000, 4),
    (50000, 5),
    (1500000, 6),
    (10000, 7);

INSERT INTO
    user_groups (user_id, group_id)
VALUES
    (1, 1),
    (1, 2),
    (2, 3);

INSERT INTO
    buy_reports (festival_item_id, amount, memo, paid_by)
VALUES
    (1, 5000, '', 'テスト太郎'),
    (1, 4000, '', 'テスト太郎'),
    (2, 5000, '', 'テスト太郎'),
    (3, 2000, '', 'テスト2太郎'),
    (3, 2000, '', 'テスト2太郎'),
    (3, 2000, '', 'テスト2太郎'),
    (4, 10000, '', 'テスト3太郎');

INSERT INTO
    payment_receipts (buy_report_id, bucket_name, file_name, file_type, remark)
VALUES
    (1, 'payment-receipts', 'receipt-1.jpg', 'image/jpeg', ''),
    (2, 'payment-receipts', 'receipt-2.jpg', 'image/jpeg', ''),
    (3, 'payment-receipts', 'receipt-3.jpg', 'image/jpeg', '');

INSERT INTO
    buy_statuses (buy_report_id, is_packed, is_settled)
VALUES
    (1, TRUE, TRUE),
    (2, TRUE, FALSE),
    (3, TRUE, FALSE),
    (4, FALSE, FALSE),
    (5, FALSE, FALSE),
    (6, TRUE, FALSE),
    (7, FALSE, FALSE);

INSERT INTO
    income_expenditure_managements (amount, log_category, year_id, receive_option, is_checked, created_at, updated_at)
VALUES
    (50000, "income", 1, "hand", FALSE, NOW(), NOW()),
    (100000, "sponsor's income", 1, "transfer", FALSE, NOW(), NOW()),
    (5000, "expenditure", 1, NULL, FALSE, NOW(), NOW()),
    (4000, "expenditure", 1, NULL, FALSE, NOW(), NOW()),
    (5000, "expenditure", 1, NULL, FALSE, NOW(), NOW()),
    (2000, "expenditure", 1, NULL, FALSE, NOW(), NOW()),
    (2000, "expenditure", 1, NULL, FALSE, NOW(), NOW()),
    (2000, "expenditure", 1, NULL, FALSE, NOW(), NOW()),
    (10000, "expenditure", 1, NULL, FALSE, NOW(), NOW());

INSERT INTO
    buy_report_income_expenditure_managements (buy_report_id, income_expenditure_management_id, created_at, updated_at)
VALUES
    (1, 3, NOW(), NOW()), -- buy_reports.id: 1 と income_expenditure_managements.id: 3 の対応
    (2, 4, NOW(), NOW()), -- buy_reports.id: 2 と income_expenditure_managements.id: 4 の対応
    (3, 5, NOW(), NOW()), -- buy_reports.id: 3 と income_expenditure_managements.id: 5 の対応
    (4, 6, NOW(), NOW()), -- buy_reports.id: 4 と income_expenditure_managements.id: 6 の対応
    (5, 7, NOW(), NOW()), -- buy_reports.id: 5 と income_expenditure_managements.id: 7 の対応
    (6, 8, NOW(), NOW()), -- buy_reports.id: 6 と income_expenditure_managements.id: 8 の対応
    (7, 9, NOW(), NOW());

INSERT INTO
    activities (user_id, is_done, sponsor_id, feature, expense, remark, design, url)
VALUES
    (1, false, 1, "なし", 11, "", 1, ""),
    (2, false, 2, "クーポン", 22, "味玉or大盛無料", 1, "");

INSERT INTO
    activity_styles (activity_id, sponsor_style_id)
VALUES
    (1, 1),
    (2, 2),
    (1, 2),
    (2, 1);

INSERT INTO
    bureaus (name)
VALUES
    ('総務局'),
    ('渉外局'),
    ('財務局'),
    ('企画局'),
    ('制作局'),
    ('情報局');

INSERT INTO
    departments (name)
VALUES
    ('電気電子情報'),
    ('物質生物'),
    ('機械創造'),
    ('環境社会基盤'),
    ('情報・経営システム'),
    ('基盤共通教育'),
    ('原子力システム安全'),
    ('技術科学イノベーション'),
    ('システム安全'),
    ('技術支援'),
    ('その他'),
    ('学長・事務'),
    ('FL');

INSERT INTO
    mail_auth (email, password, user_id)
VALUES
    ("test1@example.com", "$2a$10$vtmStGYxc8/HdhBYJWyztOMrdpw1QaKxsuGdi72i8iqeyp.1997ke", 1),
    ("test2@example.com", "$2a$10$vtmStGYxc8/HdhBYJWyztOMrdpw1QaKxsuGdi72i8iqeyp.1997ke", 2),
    ("test3@example.com", "$2a$10$vtmStGYxc8/HdhBYJWyztOMrdpw1QaKxsuGdi72i8iqeyp.1997ke", 3),
    ("test4@example.com", "$2a$10$vtmStGYxc8/HdhBYJWyztOMrdpw1QaKxsuGdi72i8iqeyp.1997ke", 4);

INSERT INTO
    roles (name)
VALUES
    ('user'),
    ('admin'),
    ('Finance Director'),
    ('Finance Staff');

INSERT INTO
    sponsor_styles (style, feature, price)
VALUES
    ('8分の1', 'モノクロ', 3000),
    ('8分の1', 'カラー', 5000),
    ('4分の1', 'モノクロ', 8000),
    ('4分の1', 'カラー', 10000),
    ('2分の1', 'モノクロ', 12000),
    ('2分の1', 'カラー', 15000),
    ('1ページ', 'モノクロ', 20000),
    ('2ページ', 'カラー', 30000),
    ('企業ブース', 'なし', 30000);

INSERT INTO
    teachers (name, position, department_id, room, is_black, remark)
VALUES
    ('test-name', 'test-position', 1, '605', false, 'test-remark'),
    ('test-teacher', 'test-position2', 1, '605', false, 'test-remark');

INSERT INTO
    teachers (name, position, department_id, room, is_black, remark)
VALUES
    ('小野 浩司', '教授', 1, '電気棟-602', false, ''),
    ('岩橋 政宏', '教授', 1, '電気棟-510', false, ''),
    ('木村 宗弘', '教授', 1, '電気棟-607', false, ''),
    ('大石 潔', '教授', 1, '実験実習2号棟情報システム実験室', false, ''),
    ('三浦 友史', '教授', 1, '電気棟-403', false, ''),
    ('坪根 正', '教授', 1, '電気棟-306', false, ''),
    ('田中 久仁彦', '教授', 1, '電気2号棟-452', false, ''),
    ('宮崎 敏昌', '教授', 1, '電気2号棟-374', false, ''),
    ('岡元 智一郎', '准教授', 1, '電気棟-401', false, ''),
    ('圓道 知博', '准教授', 1, '電気棟-610', false, ''),
    ('杉田 泰則', '准教授', 1, '電気棟-503', false, ''),
    ('鵜沼 毅也', '准教授', 1, '電気棟-502', false, ''),
    ('佐々木 友之', '准教授', 1, '電気棟-604', false, ''),
    ('玉山 泰宏', '准教授', 1, '電気棟-402', false, ''),
    ('南部 功夫', '准教授', 1, '電気棟-606', false, ''),
    ('和田森 直', '助教', 1, '電気2号棟-233', false, ''),
    ('横倉 勇希', '助教授', 1, '実験実習2号棟-115', false, ''),
    ('高橋 一匡', '助教', 1, '原子力棟-401', false, ''),
    ('白清 学', '助教', 1, '情報処理センター102', false, ''),
    ('渡部 康平', '准教授', 1, '電気棟-316', false, ''),
    ('坂本 盛嗣', '准教授', 1, '電気2号棟-669', false, ''),
    ('原川 良介', '助教', 1, '電気2号棟-554', false, ''),
    ('眞田 亜紀子', '准教授', 1, '電気1号棟-302', false, ''),
    ('日高 勇気', '准教授', 1, '電気1号棟-505', false, ''),
    ('LE THI TINH MINH', '准教授', 1, '', false, ''),
    ('TRAN PHUONG THAO', '助教', 1, '実験実習2号棟120', false, ''),
    ('圓山 由子', '助教', 1, '電気2号棟-659', false, ''),
    ('金井 綾香', '助教', 1, '電気2号棟-451', false, ''),
    ('渡辺 大貴', '助教', 1, '', false, ''),
    ('滝本 浩一', '教授', 2, '生物棟-656', false, ''),
    ('政井 英司', '教授', 2, '生物棟-353', false, ''),
    ('城所 俊一', '教授', 2, '生物棟-756', false, ''),
    ('本多 元', '教授', 2, '生物棟-657', false, ''),
    ('高橋 祥司', '教授', 2, '生物棟-668', false, ''),
    ('志田 洋介', '准教授', 2, '生物棟-357', false, ''),
    ('木村 悟隆', '准教授', 2, '生物棟-554', false, ''),
    ('高原 美規', '准教授', 2, '生物棟-557', false, ''),
    ('霜田 靖', '准教授', 2, '生物棟-753', false, ''),
    ('佐藤 武史', '准教授', 2, '生物棟-556', false, ''),
    ('山本 麻希', '准教授', 2, '生物棟-255', false, ''),
    ('西村 泰介', '准教授', 2, '生物棟-755', false, ''),
    ('笠井 大輔', '准教授', 2, '生物棟-351', false, ''),
    ('桑原 敬司', '准教授', 2, '生物棟-257', false, ''),
    ('藤原 郁子', '准教授', 2, '生物棟-656', false, ''),
    ('上村 直史', '准教授', 2, '生物棟-367', false, ''),
    ('内山 尚志', '助教', 2, '生物棟-563', false, ''),
    ('早乙女 友規', '助教', 2, '生物棟-756', false, ''),
    ('斎藤 秀俊', '教授', 2, '物材経情棟-428', false, ''),
    ('竹中 克彦', '教授', 2, '物材経情棟-326', false, ''),
    ('前川 博史', '教授', 2, '物材経情棟-329', false, ''),
    ('石橋 隆幸', '教授', 2, '物材経情棟-423', false, ''),
    ('今久保 達郎', '教授', 2, '物材経情棟-524', false, ''),
    ('梅田 実', '教授', 2, '物材経情棟-523', false, ''),
    ('河原 成元', '教授', 2, '物材経情棟-327', false, ''),
    ('伊藤 治彦', '准教授', 2, '物材経情棟-530', false, ''),
    ('内田 希', '准教授', 2, '物材経情2号棟-430', false, ''),
    ('齊藤 信雄', '准教授', 2, '分析計測センター209', false, ''),
    ('本間 剛', '准教授', 2, '物材経情棟-424', false, ''),
    ('高橋 由紀子', '准教授', 2, '環境棟-464', false, ''),
    ('多賀谷 基博', '准教授', 2, '物材経情棟-525', false, ''),
    ('白仁田 沙代子', '准教授', 2, '物材経情棟-215', false, ''),
    ('西川 雅美', '准教授', 2, '環境棟-465', false, ''),
    ('船津 麻美', '准教授', 2, '環境棟-466', false, ''),
    ('小松 啓志', '助教', 2, '物材経情棟-522', false, ''),
    ('戸田 智之', '助教', 2, '物材経情棟-522', false, ''),
    ('シリポーン タオガァオ', '助教', 2, '物材経情棟-522', false, ''),
    ('松田 翔風', '助教', 2, '物材経情棟-522', false, ''),
    ('張 田原', '助教', 2, '物財経情棟-427', false, ''),
    ('明田川 正人', '教授', 3, '機械・建設棟-508', false, ''),
    ('井原 郁夫', '教授', 3, '機械・建設棟-503', false, ''),
    ('高橋 勉', '教授', 3, '機械・建設棟-601', false, ''),
    ('太田 浩之', '教授', 3, '機械・建設棟-506', false, ''),
    ('武田 雅敏', '教授', 3, '機械・建設棟-509', false, ''),
    ('上村 靖司', '教授', 3, '機械・建設棟-407', false, ''),
    ('南口 誠', '教授', 3, '機械・建設棟-302', false, ''),
    ('木村 哲也', '教授', 3, '機械・建設棟-308', false, ''),
    ('磯部 浩巳', '教授', 3, '機械・建設棟-603', false, ''),
    ('小林 泰秀', '准教授', 3, '機械・建設棟-405', false, ''),
    ('宮下 幸雄', '教授', 3, '機械・建設棟-304', false, ''),
    ('本間 智之', '准教授', 3, '機械・建設棟-501', false, ''),
    ('倉橋 貴彦', '准教授', 3, '機械・建設棟-608', false, ''),
    ('勝身 俊之', '准教授', 3, '機械・建設棟-602', false, ''),
    ('會田 英雄', '准教授', 3, '機械・建設棟-607', false, ''),
    ('鈴木 正太郎', '准教授', 3, '機械・建設棟-604', false, ''),
    ('庄司 観', '准教授', 3, '機械・建設棟-408', false, ''),
    ('溝尻 瑞枝', '准教授', 3, '機械・建設棟-401', false, ''),
    ('韋 冬', '准教授', 3, '機械・建設棟-404', false, ''),
    ('NGUYEN THI PHUONG MAI ', '准教授', 3, '機械・建設棟-', false, ''),
    ('山下 健', '助教', 3, '機械・建設棟‐2号568', false, ''),
    ('梅本 和希', '助教', 3, '機械・建設棟-2号568‐B', false, ''),
    ('馬場 将亮', '助教', 3, '機械・建設棟-2号574', false, ''),
    ('横田 和哉', '助教', 3, '機械・建設棟-2号572', false, ''),
    ('原 圭祐', '助教', 3, '機械・建設棟-1号610', false, ''),
    ('郭 妍伶', '助教', 3, '機械・建設棟-369', false, ''),
    ('陸 旻皎', '教授', 4, '環境棟-653', false, ''),
    ('細山田 得三', '教授', 4, '機械・建設棟-807', false, ''),
    ('池田 隆明', '教授', 4, '機械・建設棟-805', false, ''),
    ('豊田 浩史', '教授', 4, '機械・建設棟-705', false, ''),
    ('高橋 修', '教授', 4, '機械・建設棟-704', false, ''),
    ('下村 匠', '教授', 4, '機械・建設棟-703', false, ''),
    ('岩崎 英治', '教授', 4, '機械・建設棟-701', false, ''),
    ('佐野 可寸志', '教授', 4, '環境棟-366/原子力棟411', false, ''),
    ('小松 俊哉', '准教授', 4, '環境棟-554', false, ''),
    ('熊倉 俊郎', '准教授', 4, '環境棟-652', false, ''),
    ('高橋 一義', '准教授', 4, '環境棟-654', false, ''),
    ('宮下 剛', '准教授', 4, '機械・建設棟-706', false, ''),
    ('松田 曜子', '准教授', 4, '環境棟-651', false, ''),
    ('犬飼 直之', '准教授', 4, '機械・建設棟-801', false, ''),
    ('松川 寿也', '助教授', 4, '環境棟-364', false, ''),
    ('中村 文則', '准教授', 4, '機械・建設棟-708', false, ''),
    ('福元 豊', '准教授', 4, '機械・建設棟-804', false, ''),
    ('幡本 将史', '准教授', 4, '環境棟-569', false, ''),
    ('楊 宏選', '助教', 4, '環境棟-659', false, ''),
    ('渡利 高大', '助教授', 4, '環境棟-571', false, ''),
    ('坂田 健太', '助手', 4, '環境棟-655', false, ''),
    ('高橋 貴生', '助教授', 4, '環境棟-367', false, ''),
    ('加藤 哲平', '講師', 4, '物材経情棟-365', false, ''),
    ('李 志東', '教授', 5, '物材経情棟-302', false, ''),
    ('塩野谷 明', '教授', 5, '体育保健センター-108', false, ''),
    ('野村 収作', '教授', 5, '機械・建設3号棟-534', false, ''),
    ('秋元 頼孝', '准教授', 5, '物材経情棟-304', false, ''),
    ('羽山 徹彩', '教授', 5, '総合研究棟‐408', false, ''),
    ('伊藤 喜浩', '教授', 5, '総合研究棟‐305', false, ''),
    ('綿引 宣道', '教授', 5, '総合研究棟‐303', false, 'メールアポ必須'),
    ('西山 雄大', '教授', 5, '総合研究棟-603', false, ''),
    ('大村 哲臣', '教授', 5, '', false, '居室不明'),
    ('鈴木 信貴', '准教授', 5, '物材経情棟-402', false, ''),
    ('大橋 智志', '准教授', 5, '物材経情棟-403', false, ''),
    ('白川 智弘', '准教授', 5, '物材経情棟-404', false, ''),
    ('中平 勝子', '准教授', 5, '語学センター棟‐212', false, '居室不明'),
    ('吉田 富美男', '助教', 5, '機械・建設3号棟-539', false, ''),
    ('鈴木 泉', '助教', 5, '総合研究棟-407', false, ''),
    ('畦原 宗之', '助教', 5, '総合研究棟-406', false, ''),
    ('永森 正仁', '助教', 5, '総合研究棟-506', false, ''),
    ('安藤 雅洋', '助教', 5, 'マルチメディアセンター-201', false, ''),
    ('高橋 光子', '教授', 6, '物材情経棟-504', false, ''),
    ('原 信一郎', '教授', 6, '環境棟-267', false, ''),
    ('加藤 有行', '教授', 6, '電気1号棟-303', false, ''),
    ('若林 敦', '教授', 6, '物質材開棟-503', false, ''),
    ('松原 浩', '教授', 6, '物材経情棟-308', false, ''),
    ('加納 満', '准教授', 6, '物材経情棟-307', false, ''),
    ('リー 飯塚 尚子', '准教授', 6, '物質材開棟-306', false, ''),
    ('伊藤 敦美', '准教授', 6, '物材経情棟-509', false, ''),
    ('藤井 数馬', '准教授', 6, '物材経情棟-507', false, ''),
    ('山本 謙一郎', '准教授', 6, '環境棟-268', false, ''),
    ('重田 謙', '准教授', 6, '物材経情棟-', false, ''),
    ('永野 建二郎', '講師', 6, '物材経情棟-310', false, ''),
    ('五十嵐 啓太', '講師', 6, '物材経情棟-506', false, ''),
    ('山口 勇気', '講師', 6, '機械建設1号棟-505', false, ''),
    ('片野 洋平', '講師', 6, '物材経情棟-309', false, ''),
    ('ドライアー ブライアン', '助教', 6, '物材経情棟-508', false, ''),
    ('江 偉華', '教授', 7, '極限-粒子棟201', false, ''),
    ('末松 久幸', '教授', 7, '極限-粒子棟203', false, ''),
    ('鈴木 達也', '教授', 7, '原子力安全・シス安棟-412', false, ''),
    ('大塚 悟', '教授', 7, '機械・建設棟-802', false, ''),
    ('菊池 崇志', '准教授', 7, '原子力安全・シス安棟-409', false, ''),
    ('鈴木 常生', '准教授', 7, '原子力安全・シス安棟-410', false, ''),
    ('村上 健太', '准教授', 7, '原子力安全・シス安棟-310', false, ''),
    ('大場 恭子', '准教授', 7, '原子力安全・シス安棟-312', false, ''),
    ('竹澤 宏樹', '准教授', 7, '原子力安全・シス安棟-313', false, ''),
    ('太田 朋子', '准教授', 7, '原子力安全・シス安棟-508', false, ''),
    ('松本 義伸', '助教', 7, 'ラジオアイソトープセンター 101', false, ''),
    ('須貝 太一', '助教', 7, '極限棟-201', false, ''),
    ('立花 優', '助教授', 7, '原子力安全・シス安棟-311', false, ''),
    ('ドウ テイ マイ ズン', '助教授', 7, '原子力安全・シス安棟-205', false, ''),
    ('VLAD CRISTIAN IULIAN', '教授', 8, '', false, '居室不明'),
    ('中川 匡弘', '教授', 8, '電気棟-609/3号棟外プレハブ カオス・フラクタル研究室', false, ''),
    ('小林 高臣', '教授', 8, '物材経情棟-526', false, ''),
    ('改田 哲也', '教授', 8, '博士棟-358', false, ''),
    ('小笠原 渉', '教授', 8, '生物棟-371', false, ''),
    ('山田 昇', '教授', 8, '機械・建設棟-507', false, ''),
    ('中山 忠親', '教授', 8, '極限-粒子棟-202', false, ''),
    ('伊東 淳一', '教授', 8, '電気棟-407', false, ''),
    ('山口 隆司', '教授', 8, '環境棟-570', false, ''),
    ('湯川 高志', '教授', 8, '総合研究棟-510', false, ''),
    ('山崎 渉', '准教授', 8, '機械・建設棟-603', false, ''),
    ('牧 慎也', '准教授', 8, '機械・建設1号棟-807', false, ''),
    ('姫野 修司', '准教授', 8, '環境棟-553', false, ''),
    ('佐々木 徹', '准教授', 8, '環境棟-304', false, ''),
    ('大沼 清', '准教授', 8, '生物棟-560', false, ''),
    ('田中 諭', '准教授', 8, '物材2号棟-429', false, ''),
    ('門脇 敏', '教授', 9, '機械・建設棟-502', false, ''),
    ('三好 孝典', '教授', 9, '原子力安全・シス安棟-614', false, ''),
    ('阿部 雅二郎', '教授', 9, '機械・建設1号棟-504', false, ''),
    ('木村 哲也', '教授', 9, '機械・建設棟-308', false, ''),
    ('山形 浩史', '教授', 9, '原子力安全・シス安棟-612', false, ''),
    ('大塚 雄市', '准教授', 9, '原子力安全・シス安棟-562', false, ''),
    ('北條 理恵子', '准教授', 9, '原子力安全・シス安棟609', false, ''),
    ('張 坤', '准教授', 9, '原子力安全・シス安棟-613', false, ''),
    ('吉田 昌弘', '技術職員', 10, '機械・建設棟-314', false, ''),
    ('安部 真', '技術職員', 10, '機械・建設2号棟-370', false, ''),
    ('山田 修一', '技術職員', 10, '原子力安全・シス安棟-511', false, ''),
    ('吉井 一夫', '技術職員', 10, '工作センター103', false, ''),
    ('山本 浩', '技術職員', 10, '機械・建設3号棟-240', false, ''),
    ('高田 晋', '技術職員', 10, '建設大型実験棟-205', false, ''),
    ('高橋 智', '技術職員', 10, '機械・建設2号棟-663', false, ''),
    ('渡邉 高子', '技術職員', 10, '環境棟-569', false, ''),
    ('中村 健', '技術職員', 10, '機械・建設1号棟-712', false, ''),
    ('豊田 英之', '技術職員', 10, '電気2号棟-471', false, ''),
    ('山口 貴幸', '技術職員', 10, '大型実験棟-203', false, ''),
    ('田中 徹', '技術職員', 10, '実験実習2号棟118', false, ''),
    ('志田 暁雄', '技術職員', 10, '極限-極限棟201W', false, ''),
    ('佐藤 賢太', '技術職員', 10, '工作センター103', false, ''),
    ('小池 孝侑', '技術職員', 10, '工作センター103', false, ''),
    ('河原 夏江', '技術職員', 10, '物材経情棟-2号562', false, ''),
    ('高橋 美幸', '技術職員', 10, '分析計測センター-118', false, ''),
    ('小杉 健一郎', '技術職員', 10, '分析計測センター-118', false, ''),
    ('高柳 充寛', '技術職員', 10, '生物棟-565', false, ''),
    ('野田 浩平', '技術職員', 10, '電気2号棟-666', false, ''),
    ('山浦 賢太郎', '技術職員', 10, '電気2号棟-569', false, ''),
    ('近藤 みずき', '技術職員', 10, '生物棟-258', false, ''),
    ('草野 利樹', '技術職員', 10, '', false, '居室不明'),
    ('上野 悠一', '技術職員', 10, '', false, '居室不明'),
    ('中山 佳子', '技術職員', 10, '環境棟-155', false, ''),
    ('山下 智樹', '特任准教授', 11, '', false, '居室不明'),
    ('日下 佳祐', '特任講師', 11, '実験実習1号棟-110', false, ''),
    ('藤沢 慶', '特任講師', 11, '機械建設1号棟-606', false, ''),
    ('中田 大貴', '特任講師', 11, '機械建設2号棟-457', false, ''),
    ('鎌土 重晴', '学長', 12, '学長室/機械・建設棟-306', false, '秘書へアポ'),
    ('和田 安弘', '副学長', 12, '電気棟-608', false, ''),
    ('秋山 和男', '理事・事務局長', 12, '理事室', false, ''),
    ('梅田 実', '副学長', 12, '実験実習2号棟-情報システム実験室', false, ''),
    ('学生支援課', '事務', 12, '', false, ''),
    ('学務課', '事務', 12, '', false, ''),
    ('国際課', '事務', 12, '', false, ''),
    ('総務課', '事務', 12, '', false, ''),
    ('財務課', '事務', 12, '', false, ''),
    ('研究・地域連携課', '事務', 12, '', false, ''),
    ('入試課', '事務', 12, '', false, ''),
    ('総合情報課', '事務', 12, '', false, ''),
    ('施設課', '事務', 12, '', false, ''),
    ('大学戦略課(3F)', '事務', 12, '', false, ''),
    ('大学戦略課(2F)', '事務', 12, '', false, ''),
    ('電気系', '系事務室', 12, '', false, ''),
    ('物質・材料・経営情報系', '系事務室', 12, '', false, ''),
    ('機械・建設事務室', '系事務室', 12, '', false, ''),
    ('生物系', '系事務室', 12, '', false, ''),
    ('環境事務室', '系事務室', 12, '', false, ''),
    ('芳賀 仁', '助教', 12, '電気2号棟-364', false, '同窓会代表。局長が挨拶へ。学内募金は毎回断っている');

INSERT INTO
    year_periods (year_id, started_at, ended_at)
VALUES
    (1, '2024-11-15 00:00:00', '2025-11-15 00:00:00');

INSERT INTO
    incomes (name, created_at, updated_at)
VALUES
    ("教育振興会費", NOW(), NOW()),
    ("学内募金", NOW(), NOW()),
    ("同窓会費", NOW(), NOW()),
    ("雑収入", NOW(), NOW()),
    ("繰越金", NOW(), NOW()),
    ("企業協賛金", NOW(), NOW());

INSERT INTO
    buildings (name)
VALUES
    ('機械・建設棟'),
    ('電気棟'),
    ('生物棟'),
    ('環境・システム棟'),
    ('物質・材料経営情報棟'),
    ('総合研究棟'),
    ('原子力・システム安全棟'),
    ('事務局棟'),
    ('極限エネルギ密度工学研究センター'),
    ('工作センター'),
    ('大型実験棟'),
    ('分析計測センター'),
    ('その他');

INSERT INTO
    building_units (building_id, unit_number)
VALUES
    (1, "1号棟"),
    (1, "2号棟"),
    (1, "3号棟"),
    (2, "1号棟"),
    (2, "2号棟"),
    (3, "1号棟"),
    (4, "1号棟"),
    (5, "1号棟"),
    (5, "2号棟"),
    (6, "1号棟"),
    (7, "1号棟"),
    (8, "1号棟"),
    (9, "1号棟"),
    (10, "1号棟"),
    (11, "1号棟"),
    (12, "1号棟"),
    (13, "1号棟");

INSERT INTO
    campus_donations (user_id, teacher_id, year_id, price, remark, is_first_check, is_last_check, received_at)
VALUES
    (1, 1, 1, 2000, "nothing", false, false, '2023-02-22'),
    (2, 2, 1, 2000, "nothing", false, false, '2022-02-22');
